; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared0 - mode
	thermograph1 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star8 - direction
	GroundStation9 - direction
	Star6 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation7 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon14)
)
(:goal (and
	(have_image Star10 infrared0)
	(have_image Star11 thermograph1)
	(have_image Planet12 infrared0)
	(have_image Phenomenon13 thermograph1)
	(have_image Phenomenon14 thermograph1)
	(have_image Planet15 infrared0)
	(have_image Phenomenon16 infrared0)
))

)

; plan
1. (turn_to satellite1 groundstation4 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 7
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
3. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite1 phenomenon16 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon16)
   goals met: 0 of 7
5. (take_image satellite1 phenomenon16 instrument1 infrared0)
   added: (have_image phenomenon16 infrared0)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon14 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon14)
   goals met: 1 of 7
7. (take_image satellite1 phenomenon14 instrument1 thermograph1)
   added: (have_image phenomenon14 thermograph1)
   goals met: 2 of 7
8. (turn_to satellite1 phenomenon13 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 7
9. (take_image satellite1 phenomenon13 instrument1 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 3 of 7
10. (turn_to satellite1 planet12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet12)
   goals met: 3 of 7
11. (take_image satellite1 planet12 instrument1 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 4 of 7
12. (turn_to satellite1 planet15 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet15)
   goals met: 4 of 7
13. (take_image satellite1 planet15 instrument1 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 5 of 7
14. (turn_to satellite1 star10 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star10)
   goals met: 5 of 7
15. (take_image satellite1 star10 instrument1 infrared0)
   added: (have_image star10 infrared0)
   goals met: 6 of 7
16. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 6 of 7
17. (take_image satellite1 star11 instrument1 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 7 of 7
